CARAVAN/app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs"
---
  def index
  	# 記事を全件取得
  	@blogs = Blog.all

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "category" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["category", "いいいいいい"], ["updated_at", "2019-05-12 09:52:04.796226"], ["id", 1]]
---
  def update
  	  blog = Blog.find(params[:id])
  	  blog.update(blog_params)